{
  "main": {
    "name":"Patrick Goulding",
    "description":"Software Engineer based in Seattle, WA",
    "image":"profilepic.jpg",
    "bio":"When I'm not trying new recipes, hiking with my dog, or fiddling with IoT automation, I create beautiful and accessible websites. Specializing in JavaScript, React and Node. I'm always open to learning new things and interesting challenges.",
    "contactmessage":"Contact me by email for technical writing, conference talks, buisness ideas, or presentations. Not currently looking for full time employment.",
    "email": "patrick@pgoulding.dev",
    "phone": "(484) 301-5385",
    "github":"https://github.com/pgoulding",
    "calendar":"https://patrick-goulding.youcanbook.me",
    "address":{
      "city":"Seattle",
      "state":"WA"
    },
    "website": "http://www.pgoulding.dev",
    "resumedownload":"./Patrick%20Goulding%20Resume.pdf",
    "social":[
      {
        "name":"twitter",
        "url":"https://twitter.com/p_goulding",
        "className":"fa fa-twitter"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/patrickgoulding/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/pgoulding",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"",
    "education":[
      {
        "school":"Turing School of Software & Design",
        "degree":"Front End Engineering Program",
        "graduated":"September 2019",
        "description":"Turing School of Software and Design is an immersive training in fundamental web technologies. Web development with JavaScript, React, Professional Client-Side development, desktop and mobile applications with web technologies."
      },
      {
        "school":"Community College of the Air Force",
        "degree":"Electronic Systems Technology",
        "graduated":"August 2013",
        "description":"The Electronics Systems Technology program teaches students to design and build electronic systems and learn about analog and digital electronics. They are able to apply the engineering and mathematical principles that they learn in order to implement and maintain electronic systems, such as computers and controllers."
      }
    ],
    "work":[
      {
        "company":"Nordstrom",
        "title":"DevOps Systems Engineer",
        "years":"August 2020 - Present",
        "description":"Responsible for software deployment, automation scripting, device configuration, operations and maintenance of on-prem servers, registers, hardware, and operating systems. Led efforts to establish hybrid cloud CICD solution for Store Commerce. Supported selling and fullfilment teams to ensure business continuity via our Brick and Mortar platforms."
      },
      {
        "company":"SchoolSAFE Communications",
        "title":"Full Stack Software Engineer",
        "years":"September 2019 - August 2020",
        "description":"Redesigned front and backend of legacy app built in Flash and PHP used for emergency school and 911 communications to utilize new technologies such as PostgreSQL, Node, React, and Redux."
      },
      {
        "company":"Heart Hospital of Austin",
        "title":"Tech Analyst II",
        "years":"May 2017 - January 2019",
        "description":"Supported 300 bed hospital network infrastructure. Assisted in Systems Administrator duties, as well as day to day problems with managing 1000+ devices (desktops, laptops, cell phones, and other proprietary hospital devices)."
      },
      {
        "company": "United States Air Force",
        "title": "Radio Frequency Transmissions Specialist (3D1X3)",
        "years": "March 2011 - March 2017",
        "description": "Established sattelite locations, long range antennas, and land mobile radios, as a Ground Control Station (GCS) maintenance technician for the Remotely Piloted Aircrafts/Unmanned Aerial Vehicles."
      },
      {
        "company": "Walker Products",
        "title": "Network Administrator",
        "years": "October 2009 - February 2017",
        "description": "Worked as a Network Administrator, overseeing a variety of day to day operations including Cisco and Dell Network configuration, Firewall Rules, Windows support and Help Desk, Hardware Repair, Cisco and Panasonic PBX Phone Configuration"
      },
      {
        "company": "Goulding Technology",
        "title": "Owner and web designer",
        "years": "January 2008 - September 2009",
        "description": "Operated as a sole proprietorhip building websites, repairing computers, setting up home and office networks, and offering technical assistance with anything the customer needed."
      },
      {
        "company": "Premier Home Theater",
        "title": "A/V Technician - Network and Phones specialist",
        "years": "May 2007 - September 2007",
        "description": "Contract work for building fully integrated smart homes in the Roaring Fork Valley. Setup networks, phones and home automation consoles."
      },
      {
        "company": "Paragon Technology Group",
        "title": "Network Technician",
        "years": "November 2006 - April 2007",
        "description": "Worked as a network technician setting up and troubleshooting networks to connect early smart home IoT devices such as lighting, media servers, video paging, security cameras and computers."
      },
      {
        "company": "ByteMarks Computer Repair",
        "title": "Computer Repair Tech",
        "years": "January 2006 - November 2006",
        "description": "Computer repair technician for a small 4 person shop. I performed antivirus/spyware removal, and hardware repairs and upgrades for client's computers. I also designed and setup the company's website in PHP and HTML. Wrote a script to enable easier remote troubleshooting of computers with VNC, using VBS."
      },
      {
        "company": "Computers4Kids AKA Clubhouse",
        "title": "Computer Repair Tech",
        "years": "January 2006 - July 2006",
        "description": "Refurbished older donated computers to be upcycled to low income families. Tested the hardware components of donated computers, cannabalizing parts from broken devices, and re-assembling into the best version we could. Created process for testing, formatting and reimaging computers with Windows 2k for entire shop."
      },
      {
        "company": "Community Broadband Network",
        "title": "Intern Networking/ISP support",
        "years": "September 2005 - March 2006",
        "description": "First job in the Tech field, setup some long range wideband antennas, learned the basics of the OSI Model, Troubleshooting, Network configuration and how to ask a LOT of questions."
      }
    ],
    "skills":[
        {
          "name": "HTML",
          "level": "90%"
        },
        {
          "name":"CSS/SCSS",
          "level":"80%"
        },
      {
        "name":"JavaScript",
        "level":"75%"
      },
      {
        "name":"ReactJS",
        "level":"80%"
      },
      {
        "name":"Redux",
        "level":"65%"
      },
      {
        "name": "SQL",
        "level": "60%"
      },
      {
        "name": "Node/Express",
        "level": "70%"
      },
      {
        "name": "Unix/Linux",
        "level": "60%"
      },
      {
        "name": "BASH",
        "level": "55%"
      },
      {
        "name":"PHP",
        "level":"40%"
      },
      {
        "name":"Python",
        "level":"40%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Palette Picker",
        "category":"App to create a comlimentary color scheme and save to a database.",
        "image":"palette-picker.png",
        "url":"https://david5280.github.io/palette-picker-fe/#/palette-picker-fe/"
      },
      {
        "title":"NASA Pic of the day",
        "category":"A simple site built with Vue for a challenge to learn and deploy a site in a new framework in a weekend.",
        "image":"nasa-apod.png",
        "url":"https://quirky-khorana-a6d420.netlify.app/#/"
      },
      {
        "title":"Compass Job Search",
        "category":"Job search app for people who are considering different locations and gives detailed city info for that job.",
        "image":"compass-job-search.png",
        "url":"https://master.d1unm2lt3lovzm.amplifyapp.com/"
      },
      {
        "title":"Light Side",
        "category":"A Star Wars fan site where you can cross refernce all canon Star Wars data, save favorites and learn more about the star wars universe.",
        "image":"light-side.png",
        "url":"https://pgoulding.github.io/lightside/"
      }
    ]
  }
}
